core.org
#+HTML_HEAD: <link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
#+PROPERTY: tangle core.jo
#+title: example code of jojo

* define function

  #+begin_src jojo
  (defun square (: int int -> int)
    dup mul end)

  (run (# 11) square dot)
  #+end_src

* loop by explicit tail-call

  #+begin_src jojo
  (defun apply-key (: jo -> *)
    (if dup jo-used? -> apply end)
    (string "undefined keyword : ") print-string
    jo->string print-string end)

  (defun stack-repl (: [io] -> *)
    (if read-jo round-bar eq? -> read-jo apply-key print-stack)
    (loop))

  (run stack-repl)
  #+end_src

* branching by if

  #+begin_src jojo
  (run (if true -> true dot end)
       (if false -> false dot end))
  #+end_src

* receive function

  #+begin_src jojo
  (defun factorial (: int -> int)
    (if dup (# 1) lteq? -> drop (# 1) end)
    dup (# 1) sub (recur) mul end)

  (run (# 0) factorial dot
       (# 1) factorial dot
       (# 2) factorial dot
       (# 3) factorial dot
       (# 4) factorial dot)
  #+end_src

* integer

  #+begin_src jojo
  (run (# 18 5) mod dot)
  #+end_src

* string

  #+begin_src jojo
  (run (string "test1" "test2")
       print-string print-string)
  #+end_src

* file

  #+begin_src jojo
  (run (string "README")
       (# 1024) allocate tuck
       (# 1024) read-file dot
       print-string)
  #+end_src

* system

  #+begin_src jojo
  (run getcwd print-string newline)
  #+end_src

* var

  #+begin_src jojo
  (defvar var1 (# 666) (# 666) add)
  (run var1 dot)
  #+end_src

* jo

  #+begin_src jojo
  (run (jo null) jo->string print-string newline)
  #+end_src

* list

