core.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-21 Tue 04:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>example code of jojo</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
長悲嘆而掩面兮 憐其獨於夢睹
</div>
<div id="content">
<h1 class="title">example code of jojo</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgad10d1a">define function</a></li>
<li><a href="#orga6e3b86">loop by explicit tail-call</a></li>
<li><a href="#orgdc9948f">branching by if</a></li>
<li><a href="#orgf6f18de">receive function</a></li>
<li><a href="#org208c360">integer</a></li>
<li><a href="#orgd7fea60">string</a></li>
<li><a href="#orgc986261">file</a></li>
<li><a href="#orga15e4f2">system</a></li>
<li><a href="#org6f6ce26">var</a></li>
<li><a href="#org55a82b6">jo</a></li>
<li><a href="#orge6c0d6f">list</a>
<ul>
<li><a href="#org381817e">cons-area</a></li>
<li><a href="#orgf45f225">cons-area-report</a></li>
<li><a href="#org4846ae5">sweep-cons-area</a></li>
<li><a href="#org57e96c5">mark-cons-area</a></li>
<li><a href="#orgd541bf2">cons</a></li>
<li><a href="#org6a13b3a"><span class="done test">test</span> </a></li>
<li><a href="#orgdb87f09">list</a></li>
<li><a href="#org7513958"><span class="done test">test</span> </a></li>
<li><a href="#org66e67ca">print-int-list</a></li>
<li><a href="#org1b18e2e">print-jo-list</a></li>
<li><a href="#org96b496d"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgf2ae70d">report</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgad10d1a" class="outline-2">
<h2 id="orgad10d1a">define function</h2>
<div class="outline-text-2" id="text-orgad10d1a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">square</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> int int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span>
  dup mul <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 11<span style="color: #696969;">)</span> square dot<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6e3b86" class="outline-2">
<h2 id="orga6e3b86">loop by explicit tail-call</h2>
<div class="outline-text-2" id="text-orga6e3b86">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">apply-key</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> jo <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> *<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup jo-used? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> apply <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"undefined keyword : "</span><span style="color: #696969;">)</span> print-string
  jo-&gt;string print-string <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">stack-repl</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> *<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> read-jo round-bar eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> read-jo apply-key print-stack<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> stack-repl<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc9948f" class="outline-2">
<h2 id="orgdc9948f">branching by if</h2>
<div class="outline-text-2" id="text-orgdc9948f">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> true <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> true dot <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> false <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> false dot <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6f18de" class="outline-2">
<h2 id="orgf6f18de">receive function</h2>
<div class="outline-text-2" id="text-orgf6f18de">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">factorial</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> int <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> int<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> lteq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> sub <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #696969;">)</span> mul <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span> factorial dot
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> factorial dot
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 2<span style="color: #696969;">)</span> factorial dot
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 3<span style="color: #696969;">)</span> factorial dot
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 4<span style="color: #696969;">)</span> factorial dot<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org208c360" class="outline-2">
<h2 id="org208c360">integer</h2>
<div class="outline-text-2" id="text-org208c360">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 18 5<span style="color: #696969;">)</span> mod dot<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7fea60" class="outline-2">
<h2 id="orgd7fea60">string</h2>
<div class="outline-text-2" id="text-orgd7fea60">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"test1"</span> <span style="color: #e6db74;">"test2"</span><span style="color: #696969;">)</span>
     print-string print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc986261" class="outline-2">
<h2 id="orgc986261">file</h2>
<div class="outline-text-2" id="text-orgc986261">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"README"</span><span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1024<span style="color: #696969;">)</span> allocate tuck
     <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1024<span style="color: #696969;">)</span> read-file dot
     print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga15e4f2" class="outline-2">
<h2 id="orga15e4f2">system</h2>
<div class="outline-text-2" id="text-orga15e4f2">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> getcwd print-string newline<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f6ce26" class="outline-2">
<h2 id="org6f6ce26">var</h2>
<div class="outline-text-2" id="text-org6f6ce26">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> var1 <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 666<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 666<span style="color: #696969;">)</span> add<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> var1 dot<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org55a82b6" class="outline-2">
<h2 id="org55a82b6">jo</h2>
<div class="outline-text-2" id="text-org55a82b6">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jo</span> null<span style="color: #696969;">)</span> jo-&gt;string print-string newline<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
