core.org
*** cons-area

    #+begin_src jojo
    (defvar cons-size (# 3) cell-size mul)
    (defvar cons-area-size (# 5) (: (# 1024 1024) mul) cons-size mul)

    (defvar cons-area cons-area-size allocate)
    (defvar cons-area-top cons-area cons-area-size add)

    (defvar cons-pointer cons-area)

    (defun cons-pointer/next (: -> [cons-pointer])
      cons-size cons-pointer add
      (var cons-pointer) set)

    (defun cons-pointer/init (: -> [cons-pointer])
      cons-area
      (var cons-pointer) set)

    (defun cons-pointer/next-free (: -> [cons-pointer])
      (if cons-pointer cons-area-top eq? -> end)
      (if cons-pointer get currnet-mark eq? not -> end)
      cons-pointer/next
      (loop))
    #+end_src

*** cons-area-report

    #+begin_src jojo
    (declare
      (car (: cons -> cell))
      (cdr (: cons -> cell)))

    (defun cons-area-report/loop (: cons -> [io])
      (if dup cons-area-top eq? -> drop end)
      (string "#:") print-string
      dup dot
      (string "mark: ") print-string
      dup get dot
      (string "car: ") print-string
      dup car dot
      (string "cdr: ") print-string
      dup cdr dot
      newline
      cons-size add
      (loop))

    (defun cons-area-report (: -> [io])
      cons-area cons-area-report/loop)
    #+end_src

*** sweep-cons-area

    #+begin_src jojo
    (defun sweep-cons-area/loop (: cons -> [io])
      (if dup cons-area-top eq? -> drop end)
      dup (# 0)  swap set
      cons-size add
      (loop))

    (defun sweep-cons-area (: -> [cons-area])
      cons-area sweep-cons-area/loop)
    #+end_src

