core.html

<div id="outline-container-orge6c0d6f" class="outline-2">
<h2 id="orge6c0d6f">list</h2>
<div class="outline-text-2" id="text-orge6c0d6f">
</div><div id="outline-container-org381817e" class="outline-3">
<h3 id="org381817e">cons-area</h3>
<div class="outline-text-3" id="text-org381817e">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> cons-size <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 3<span style="color: #696969;">)</span> cell-size mul<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> cons-area-size <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 5<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1024 1024<span style="color: #696969;">)</span> mul<span style="color: #696969;">)</span> cons-size mul<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> cons-area cons-area-size allocate<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> cons-area-top cons-area cons-area-size add<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> cons-pointer cons-area<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons-pointer/next</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-pointer<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  cons-size cons-pointer add
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">var</span> cons-pointer<span style="color: #696969;">)</span> set<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons-pointer/init</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-pointer<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  cons-area
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">var</span> cons-pointer<span style="color: #696969;">)</span> set<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons-pointer/next-free</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-pointer<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> cons-pointer cons-area-top eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> cons-pointer get currnet-mark eq? not <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  cons-pointer/next
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf45f225" class="outline-3">
<h3 id="orgf45f225">cons-area-report</h3>
<div class="outline-text-3" id="text-orgf45f225">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">declare</span>
  <span style="color: #696969;">(</span>car <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cell<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>cdr <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cell<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons-area-report/loop</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons-area-top eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"#:"</span><span style="color: #696969;">)</span> print-string
  dup dot
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"mark: "</span><span style="color: #696969;">)</span> print-string
  dup get dot
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"car: "</span><span style="color: #696969;">)</span> print-string
  dup car dot
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"cdr: "</span><span style="color: #696969;">)</span> print-string
  dup cdr dot
  newline
  cons-size add
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons-area-report</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  cons-area cons-area-report/loop<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4846ae5" class="outline-3">
<h3 id="org4846ae5">sweep-cons-area</h3>
<div class="outline-text-3" id="text-org4846ae5">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">sweep-cons-area/loop</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons-area-top eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span>  swap set
  cons-size add
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">sweep-cons-area</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-area<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  cons-area sweep-cons-area/loop<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
