core.org
*** mark-cons-area

    - root from
      - stack
      - defvar

    #+begin_src jojo
    (defvar currnet-mark (# 1))
    (defvar max-mark (# 3))

    (defun mark-cons (: cons -> [cons-area])
      (if dup cons? not -> drop end)
      dup currnet-mark swap set
      dup car mark-cons
      cdr (loop))

    (defun mark-cons-area-for-defvar (: defvar-record/addr -> [cons-area])
      (if dup get (# 0) eq? -> drop end)
      dup get mark-cons
      cell-size add
      (loop))

    (defun mark-cons-area-for-stack (: stack/addr -> [cons-area])
      (if dup stack-base eq? -> drop end)
      cell-size sub
      dup get mark-cons
      (loop))

    (defun mark-cons-area (: -> [cons-area])
      (if currnet-mark max-mark eq? ->
          sweep-cons-area
          (# 0) (var currnet-mark) set)
      currnet-mark (# 1) add (var currnet-mark) set
      defvar-record mark-cons-area-for-defvar
      stack-pointer
      mark-cons-area-for-stack)
    #+end_src

*** cons

    - cons
      | mark |
      | car  |
      | cdr  |

    #+begin_src jojo
    (defun new-cons (: -> cons)
      (if cons-pointer cons-area-top eq? ->
          mark-cons-area
          cons-pointer/init
          cons-pointer/next-free
          (if cons-pointer cons-area-top eq? ->
              (string "fatal error : cons-area is full") print-string
              newline bye)
          (loop))
      (if cons-pointer get currnet-mark eq? ->
          cons-pointer/next (loop))
      cons-pointer
      cons-pointer/next end)

    (defun set-car (: cell cons -> cons)
      tuck
      cell-size add
      set)

    (defun set-cdr (: cell cons -> cons)
      tuck
      cell-size add
      cell-size add
      set)

    (defun car (: cons -> cell)
      cell-size add
      get)

    (defun cdr (: cons -> cell)
      cell-size add
      cell-size add
      get)

    (defun cons? (: cell -> bool)
      (if dup cons-area lt? -> drop false end)
      (if dup cons-area-top gteq? -> drop false end)
      cons-area sub cons-size mod (# 0) eq?)

    (defun cons (: cdr-cell car-cell -> cons)
      new-cons set-car set-cdr)
    #+end_src

*** test

    #+begin_src jojo
    (: (run (# 0)
            (# 1) cons
            (# 2) cons
            dup car dot
            dup cdr car dot
            dup cdr cdr dot

            dup cons? dot
            dup cdr cons? dot
            dup car cons? dot
            dup cdr car cons? dot
            dup cdr cdr cons? dot
            dot

            currnet-mark
            dot))

    (: (run newline
            new-cons dot
            new-cons dot
            new-cons dot
            new-cons dot
            new-cons dot
            currnet-mark dot
            newline
            cons-area-report
            newline))
    #+end_src

