core.html

<div id="outline-container-org57e96c5" class="outline-3">
<h3 id="org57e96c5">mark-cons-area</h3>
<div class="outline-text-3" id="text-org57e96c5">
<ul class="org-ul">
<li><p>root from</p><p><ul class="org-ul"></p><p><li><p>stack</p></li></p><p><li><p>defvar</p></li></ul></p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> currnet-mark <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defvar</span> max-mark <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 3<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">mark-cons</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-area<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons? not <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup currnet-mark swap set
  dup car mark-cons
  cdr <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">mark-cons-area-for-defvar</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> defvar-record/addr <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-area<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup get <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span> eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup get mark-cons
  cell-size add
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">mark-cons-area-for-stack</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> stack/addr <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-area<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup stack-base eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  cell-size sub
  dup get mark-cons
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">mark-cons-area</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>cons-area<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> currnet-mark max-mark eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      sweep-cons-area
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">var</span> currnet-mark<span style="color: #696969;">)</span> set<span style="color: #696969;">)</span>
  currnet-mark <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> add <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">var</span> currnet-mark<span style="color: #696969;">)</span> set
  defvar-record mark-cons-area-for-defvar
  stack-pointer
  mark-cons-area-for-stack<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd541bf2" class="outline-3">
<h3 id="orgd541bf2">cons</h3>
<div class="outline-text-3" id="text-orgd541bf2">
<ul class="org-ul">
<li><p><p></p><p>cons</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">mark</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">car</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">cdr</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">new-cons</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cons<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> cons-pointer cons-area-top eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      mark-cons-area
      cons-pointer/init
      cons-pointer/next-free
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> cons-pointer cons-area-top eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
          <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"fatal error : cons-area is full"</span><span style="color: #696969;">)</span> print-string
          newline bye<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> cons-pointer get currnet-mark eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      cons-pointer/next <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
  cons-pointer
  cons-pointer/next <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">set-car</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cell cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cons<span style="color: #696969;">)</span>
  tuck
  cell-size add
  set<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">set-cdr</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cell cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cons<span style="color: #696969;">)</span>
  tuck
  cell-size add
  cell-size add
  set<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">car</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cell<span style="color: #696969;">)</span>
  cell-size add
  get<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cdr</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cell<span style="color: #696969;">)</span>
  cell-size add
  cell-size add
  get<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons?</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cell <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> bool<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons-area lt? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop false <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons-area-top gteq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop false <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  cons-area sub cons-size mod <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span> eq?<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">cons</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cdr-cell car-cell <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> cons<span style="color: #696969;">)</span>
  new-cons set-car set-cdr<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a13b3a" class="outline-3">
<h3 id="org6a13b3a"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org6a13b3a">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 0<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> cons
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 2<span style="color: #696969;">)</span> cons
        dup car dot
        dup cdr car dot
        dup cdr cdr dot

        dup cons? dot
        dup cdr cons? dot
        dup car cons? dot
        dup cdr car cons? dot
        dup cdr cdr cons? dot
        dot

        currnet-mark
        dot<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> newline
        new-cons dot
        new-cons dot
        new-cons dot
        new-cons dot
        new-cons dot
        currnet-mark dot
        newline
        cons-area-report
        newline<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
