core.html

<div id="outline-container-orgdb87f09" class="outline-3">
<h3 id="orgdb87f09">list</h3>
<div class="outline-text-3" id="text-orgdb87f09">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #B380A8;">{</span>a <span style="color: #B380A8;">{</span>b c<span style="color: #B380A8;">}</span> d<span style="color: #B380A8;">}</span>
   null
   a cons
     null
     b cons
     c cons
   cons
   d cons<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">one-list</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>compile<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  read-jo
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup flower-bar eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      drop null here
      <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">recur</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jo</span> cons<span style="color: #696969;">)</span> here
      <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup flower-ket eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup round-bar eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      drop read-jo apply-key
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jo</span> cons<span style="color: #696969;">)</span> here
      <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">else</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jo</span> i-lit<span style="color: #696969;">)</span> here
        here
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jo</span> cons<span style="color: #696969;">)</span> here
        <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">list</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>compile<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  read-jo
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup round-ket eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup flower-bar eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
      drop null here
      one-list <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">else</span> drop <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">loop</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7513958" class="outline-3">
<h3 id="org7513958"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org7513958">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span>list <span style="color: #B380A8;">{</span>a <span style="color: #B380A8;">{</span>b c<span style="color: #B380A8;">}</span> d<span style="color: #B380A8;">}</span><span style="color: #696969;">)</span>
     dup car jo-&gt;string print-string
     dup cdr car car jo-&gt;string print-string
     dup cdr car cdr car jo-&gt;string print-string
     dup cdr car cdr cdr jo-&gt;string print-string
     dup cdr cdr car jo-&gt;string print-string
     dup cdr cdr cdr jo-&gt;string print-string
     drop<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">run</span> <span style="color: #696969;">(</span>list <span style="color: #B380A8;">{</span><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1<span style="color: #696969;">)</span> <span style="color: #B380A8;">{</span><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 2<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">jojo</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 1 2<span style="color: #696969;">)</span> add<span style="color: #696969;">)</span><span style="color: #B380A8;">}</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">#</span> 4<span style="color: #696969;">)</span><span style="color: #B380A8;">}</span><span style="color: #696969;">)</span>
     dup car dot
     dup cdr car car dot
     dup cdr car cdr car dot
     dup cdr car cdr cdr dot
     dup cdr cdr car dot
     dup cdr cdr cdr dot
     drop<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org66e67ca" class="outline-3">
<h3 id="org66e67ca">print-int-list</h3>
<div class="outline-text-3" id="text-org66e67ca">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">declare</span> <span style="color: #696969;">(</span>print-int-list <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">print-int-list/rest</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup null eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup cdr print-int-list/rest
  car
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> print-int-list <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">else</span> dot <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">print-int-list</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"{ "</span><span style="color: #696969;">)</span> print-string
  print-int-list/rest
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"} "</span><span style="color: #696969;">)</span> print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b18e2e" class="outline-3">
<h3 id="org1b18e2e">print-jo-list</h3>
<div class="outline-text-3" id="text-org1b18e2e">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">declare</span> <span style="color: #696969;">(</span>print-jo-list <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">dot-jo</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> jo <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  jo-&gt;string print-string
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">" "</span><span style="color: #696969;">)</span> print-string<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">print-jo-list/rest</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup null eq? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> drop <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  dup cdr print-jo-list/rest
  car
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> dup cons? <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> print-jo-list <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">else</span> dot-jo <span style="color: #66d9ef; font-weight: bold;">end</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">defun</span> <span style="color: #a6e22e;">print-jo-list</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">:</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #797979;">[</span>io<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"{ "</span><span style="color: #696969;">)</span> print-string
  print-jo-list/rest
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">string</span> <span style="color: #e6db74;">"} "</span><span style="color: #696969;">)</span> print-string<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
